### Writing Sample Post

In [4]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.1.0
1.18.5

In [5]:
# 위의 설정으로 간단하게 보는 df_specific
pd.set_option('display.max_colwidth', None)
df_specific = pd.read_csv("./data_wrangled/df_specific_wrangle.csv", encoding="utf-8")

In [45]:
import re
from textrankr import TextRank

# removing other letters except for korean letters from the string data
def remove_junk(str_data):
    str_data = str_data.replace("\\\\n", "")
    str_data = str_data.replace("\\n", "")
    str_data = str_data.replace("\n", "")
    str_data = str_data.replace("\\", "")
    str_data = str_data.replace("\\t", "")
    str_data = str_data.replace("NaN", "")

    # print(str_data) makes an error. too much of data
    # 한글, english 빼고 전부 날리기
    # str_data = re.sub('[^가-힣ㄱ-ㅎㅏ-ㅣa-zA-Z|0-9|.,]', ' ', str_data)

    # 한글 빼고 다 날리기
    str_data = re.sub('[^가-힣ㄱ-ㅎㅏ]', ' ', str_data)

    # replace multiple spaces into single space
    str_data = ' '.join(str_data.split())
    return str_data

def access_univ_info(dataframe, column, univ_code):
    df_row = dataframe.loc[dataframe["대학코드"] == univ_code]
    str_univ_info = df_row[column].to_string(index=False).lstrip()
    str_univ_info = remove_junk(str_univ_info)
    return str_univ_info


# removing junks only from the string data
def remove_junk_only(str_data):
    str_data = str_data.replace("\\\\n", "")
    str_data = str_data.replace("\\n", "")
    str_data = str_data.replace("\n", "")
    str_data = str_data.replace("\\", "")
    str_data = str_data.replace("\\t", "")
    str_data = str_data.replace("NaN", "")

    # replace multiple spaces into single space
    str_data = ' '.join(str_data.split())
    return str_data

# accessing university info of given column (= accessing one cell)
def access_univ_info_raw(dataframe, column, univ_code):
    df_row = dataframe.loc[dataframe["대학코드"] == univ_code]
    str_univ_info = df_row[column].to_string(index=False).lstrip()
    str_univ_info = remove_junk_only(str_univ_info)
    return str_univ_info

# collecting all column values into one string
def column_to_string(dataframe, column_name: str):
    str_corpus = dataframe[column_name].to_string(index=False).lstrip()
    str_corpus = remove_junk_only(str_corpus)
    return str_corpus

def yield_summary(df_specific, column_data, univ_code):
    string_data = access_univ_info_raw(df_specific, column_data, univ_code)

    textrank = TextRank(string_data)
    # print(textrank.summarize())  # gives you some text
    summarized_list = textrank.summarize(6, verbose=False)

    summary_text_md = ""

    for sentence in summarized_list:
        summary_line = \
f"""* {sentence}
"""
        summary_text_md += summary_line

    return summary_text_md

In [41]:
university_title = "University of Lausanne"
continent = "Europe"
university_title_without_space = university_title.replace(" ", "+")
continent_without_space = university_title.replace(" ", "-")
latitude = 46.5210895
longitude = 6.5801606
zoom_rate = 14
country = "SWITZERLAND"
rank = 1
visit_no = 8.0
visit_no_int = int(visit_no)
univ_code = "CH000004"

In [42]:
gen_info_6_lines = yield_summary(df_specific, "gen_info", "CH000004")
env_info_6_lines = yield_summary(df_specific, "env_info", "CH000004")

In [43]:
text = \
f"""---
title: '{university_title}'
date: 2020-08-19 13:01:13
category: '{continent_without_space}'
draft: false
---

<iframe
  width="600"
  height="450"
  frameborder="0" style="border:0"
  src="https://www.google.com/maps/embed/v1/place?key=AIzaSyC9e1AME-pVmWC4hBpFdu5S4dKzyepa3HQ&q={university_title_without_space}&center={latitude},{longitude}&zoom={zoom_rate}" allowfullscreen>
</iframe>

### Profile

* {country}
* 학생 만족도에서 {rank}위를 기록했습니다.
* 지금까지 {visit_no_int}명이 다녀갔습니다. 

### 교환대학의 크기, 지리적 위치, 기후 등

![gen_info-WordCloud](../univ_wordclouds_okt/gen_info/{univ_code}_gen_info_okt.png)

{gen_info_6_lines}

### 대학 주변 환경

![env_info-WordCloud](../univ_wordclouds_okt/env_info/{univ_code}_env_info_okt.png)

{env_info_6_lines}

위의 정보는 [연세대학교 학생들의 교환 후기들을](http://oia.yonsei.ac.kr/partner/expReport.asp?ucode={univ_code}&bgbn=A) NLP로 가공한 요약본입니다. 
"""

In [44]:
with open("content/blog/Europe/sample.md", "wt", encoding="UTF8") as output:
    output.write(text)

### summarize those lines into functions

In [46]:
def create_and_write_post(df_specific, university_title, continent, latitude, longitude, zoom_rate, country, rank, visit_no, univ_code):
    university_title_without_space = university_title.replace(" ", "+")
    continent_without_space = continent.replace(" ", "-")
    visit_no_int = int(visit_no)
    
    gen_info_6_lines = yield_summary(df_specific, "gen_info", univ_code)
    env_info_6_lines = yield_summary(df_specific, "env_info", univ_code)

    text = \
f"""---
title: '{university_title}'
date: 2020-08-19 13:01:13
category: '{continent_without_space}'
draft: false
---

<iframe
width="600"
height="450"
frameborder="0" style="border:0"
src="https://www.google.com/maps/embed/v1/place?key=AIzaSyC9e1AME-pVmWC4hBpFdu5S4dKzyepa3HQ&q={university_title_without_space}&center={latitude},{longitude}&zoom={zoom_rate}" allowfullscreen>
</iframe>

### Profile

* {country}
* 학생 만족도에서 {rank}위를 기록했습니다.
* 지금까지 {visit_no_int}명이 다녀갔습니다. 

### 교환대학의 크기, 지리적 위치, 기후 등

![gen_info-WordCloud](../univ_wordclouds_okt/gen_info/{univ_code}_gen_info_okt.png)

{gen_info_6_lines}

### 대학 주변 환경

![env_info-WordCloud](../univ_wordclouds_okt/env_info/{univ_code}_env_info_okt.png)

{env_info_6_lines}

위의 내용은 [{university_title}를 다녀온 연세대학교 학생들의 교환 후기들을](http://oia.yonsei.ac.kr/partner/expReport.asp?ucode={univ_code}&bgbn=A) NLP로 가공한 요약본입니다. 
"""

    with open(f"./content/blog/{continent_without_space}/{univ_code}.md", "wt", encoding="UTF8") as output:
        output.write(text)

### Writing for all the other universities

In [5]:
# pandas 설정: 모든 row와 모든 column을 출력하게 하고, 각 column 별 출력되는 글자수는 50자 이내
pd.set_option('display.max_rows', None, 'display.max_columns', None, 'display.max_colwidth', 50)

In [6]:
# 위의 설정으로 간단하게 보는 df_specific
df_univ_wrangled = pd.read_csv("./data_wrangled/df_univ_wrangled.csv", encoding="utf-8")
df_univ_wrangled.head(2)

,대학코드,국가,대학명,파견구분,협정형태,NUM_VISITS,BERT_SUM,RNN_SUM,BERT_AVG,RNN_AVG,BERT_PLUS_RNN_SCORE,COLLEGE_LINK
0,AF000001,AFGHANISTAN,Kabul University,교환학생,교환대학,NaN,NaN,NaN,NaN,NaN,NaN,http://oia.yonsei.ac.kr/partner/expReport.asp?...
1,AR000001,ARGENTINA,Universidad Blas Pascal,교환학생,ISEP,NaN,NaN,NaN,NaN,NaN,NaN,http://oia.yonsei.ac.kr/partner/expReport.asp?...

In [7]:
df_country = df_univ_wrangled[["대학코드", "국가", "대학명"]]
df_country.head()

       대학코드           국가                              대학명
0  AF000001  AFGHANISTAN                 Kabul University
1  AR000001    ARGENTINA          Universidad Blas Pascal
2  AR000002    ARGENTINA  Universidad Catolica de Cordoba
3  AR000003    ARGENTINA           Universidad de Palermo
4  AR000004    ARGENTINA         Universidad del Salvador

In [8]:
import pycountry_convert as pc

list_countries = df_country["국가"].to_list()
print(list_countries[:20])
list_country_code = []
for i in list_countries:
    country_code = pc.country_name_to_country_alpha2(i.title(), cn_name_format="default")
    list_country_code.append(country_code)
print(list_country_code[:20])

list_continent = []
for item in list_country_code:
    continent = pc.country_alpha2_to_continent_code(item)
    list_continent.append(continent)
print(list_continent[:20])

list_continent_names = []
for code in list_continent:
    country_continent_name = pc.convert_continent_code_to_continent_name(code)
    list_continent_names.append(country_continent_name)

print(list_continent_names[:20])

['AFGHANISTAN', 'ARGENTINA', 'ARGENTINA', 'ARGENTINA', 'ARGENTINA', 'ARGENTINA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA', 'AUSTRALIA']
['AF', 'AR', 'AR', 'AR', 'AR', 'AR', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU', 'AU']
['AS', 'SA', 'SA', 'SA', 'SA', 'SA', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC', 'OC']
['Asia', 'South America', 'South America', 'South America', 'South America', 'South America', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania', 'Oceania']

In [9]:
df_country["대륙"] = list_continent_names
df_country.tail()

         대학코드        국가                                            대학명      대륙
740  VN000001   VIETNAM         National Economics University of Hanoi    Asia
741  VN000003   VIETNAM             Vietnam National University, Hanoi    Asia
742  VN000005   VIETNAM  Vietnam National University, Ho Chi Minh City    Asia
743  VN000006   VIETNAM                                 Vin University    Asia
744  ZW000001  ZIMBABWE                         University of Zimbabwe  Africa

In [10]:
df_country.to_csv("./data_wrangled/df_country.csv",encoding="utf-8", index=False)

In [11]:
df_coordinates = pd.read_csv("./data_wrangled/univ_geo.csv", encoding="utf-8")
df_coordinates.head()

                               대학명            address   latitude   longitude
0         Universidad del Salvador       Buenos Aires -34.601178  -58.391496
1   Australian National University  Canberra ACT 0200 -35.277700  149.118527
2                  Bond University    Robina QLD 4226 -28.073093  153.416638
3                Curtin University    Bentley WA 6102 -32.006195  115.894418
4  Curtin University of Technology    Bentley WA 6102 -32.006195  115.894418

In [12]:
df_country_info = pd.merge(df_country, df_coordinates, how="left", on="대학명")
df_country_info.head()

,대학코드,국가,대학명,대륙,address,latitude,longitude
0,AF000001,AFGHANISTAN,Kabul University,Asia,NaN,NaN,NaN
1,AR000001,ARGENTINA,Universidad Blas Pascal,South America,NaN,NaN,NaN
2,AR000002,ARGENTINA,Universidad Catolica de Cordoba,South America,NaN,NaN,NaN
3,AR000003,ARGENTINA,Universidad de Palermo,South America,NaN,NaN,NaN
4,AR000004,ARGENTINA,Universidad del Salvador,South America,Buenos Aires,-34.601178,-58.391496

In [13]:
df_country_info.to_csv("./data_wrangled/df_country.csv",encoding="utf-8", index=False)

In [6]:
df_univ_ranking = pd.read_csv("./data_wrangled/df_univ_ranking.csv", encoding="utf-8")
df_univ_ranking.head()

,index,대학코드,국가,대학명,파견구분,협정형태,NUM_VISITS,BERT_SUM,RNN_SUM,BERT_AVG,RNN_AVG,BERT_PLUS_RNN_SCORE,COLLEGE_LINK,대륙,address,latitude,longitude
0,376,CH000004,SWITZERLAND,University of Lausanne,교환학생,교환대학ISEP,8.0,8.0,6.659102,1.000000,0.832388,0.949716,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=CH000004&bgbn=A,Europe,1015 Lausanne,46.521090,6.580161
1,284,MX000004,MEXICO,Instituto Tecnologico y de Estudios Superiores de Monterrey (ITESM)-Monterrey,교환학생,교환대학ISEP,7.0,7.0,5.665700,1.000000,0.809386,0.942816,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=MX000004&bgbn=A,North America,N.L.,25.651565,-100.289540
2,415,GB000010,UNITED KINGDOM,University of Edinburgh,교환학생방문학생SAP(정규),교환대학SAF,7.0,7.0,5.607286,1.000000,0.801041,0.940312,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=GB000010&bgbn=A,Europe,Edinburgh EH8 9YL,55.944516,-3.189241
3,361,SE000003,SWEDEN,Kristianstad University,교환학생,교환대학,49.0,47.0,39.341540,0.959184,0.802889,0.912295,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=SE000003&bgbn=A,Europe,291 39 Kristianstad,56.048483,14.146325
4,49,CA000003,CANADA,Dalhousie University,교환학생,교환대학,6.0,6.0,4.088647,1.000000,0.681441,0.904432,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=CA000003&bgbn=A,North America,NS B3H 4R2,44.636581,-63.591656

In [16]:
df_temp = pd.merge(df_univ_ranking, df_country_info, how="left", on=["대학코드", "대학명", "국가"])
df_temp.head()

,index,대학코드,국가,대학명,파견구분,협정형태,NUM_VISITS,BERT_SUM,RNN_SUM,BERT_AVG,RNN_AVG,BERT_PLUS_RNN_SCORE,COLLEGE_LINK,대륙,address,latitude,longitude
0,376,CH000004,SWITZERLAND,University of Lausanne,교환학생,교환대학ISEP,8.0,8.0,6.659102,1.000000,0.832388,0.949716,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Europe,1015 Lausanne,46.521090,6.580161
1,284,MX000004,MEXICO,Instituto Tecnologico y de Estudios Superiores...,교환학생,교환대학ISEP,7.0,7.0,5.665700,1.000000,0.809386,0.942816,http://oia.yonsei.ac.kr/partner/expReport.asp?...,North America,N.L.,25.651565,-100.289540
2,415,GB000010,UNITED KINGDOM,University of Edinburgh,교환학생방문학생SAP(정규),교환대학SAF,7.0,7.0,5.607286,1.000000,0.801041,0.940312,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Europe,Edinburgh EH8 9YL,55.944516,-3.189241
3,361,SE000003,SWEDEN,Kristianstad University,교환학생,교환대학,49.0,47.0,39.341540,0.959184,0.802889,0.912295,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Europe,291 39 Kristianstad,56.048483,14.146325
4,49,CA000003,CANADA,Dalhousie University,교환학생,교환대학,6.0,6.0,4.088647,1.000000,0.681441,0.904432,http://oia.yonsei.ac.kr/partner/expReport.asp?...,North America,NS B3H 4R2,44.636581,-63.591656

In [17]:
df_temp.tail()

,index,대학코드,국가,대학명,파견구분,협정형태,NUM_VISITS,BERT_SUM,RNN_SUM,BERT_AVG,RNN_AVG,BERT_PLUS_RNN_SCORE,COLLEGE_LINK,대륙,address,latitude,longitude
290,94,CN000015,CHINA,Tsinghua University,교환학생,교환대학,9.0,4.0,5.523812,0.444444,0.613757,0.495238,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Asia,Beijing Shi,39.999667,116.326444
291,257,JP000026,JAPAN,Sophia University,교환학생,교환대학,7.0,3.0,4.519462,0.428571,0.645637,0.493691,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Asia,T_ky_-to 102-8554,35.683563,139.732589
292,82,CN000007,CHINA,Nanjing University,교환학생,교환대학,10.0,4.0,6.720541,0.400000,0.672054,0.481616,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Asia,Jiangsu,32.056839,118.778960
293,383,TW000005,TAIWAN,"National Taiwan University, College of Management",교환학생,교환대학,6.0,2.0,3.883967,0.333333,0.647328,0.427532,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Asia,Taipei City,25.014017,121.538144
294,354,ES000017,SPAIN,Universitat Autonoma de Barcelona,교환학생,교환대학,7.0,0.0,4.854875,0.000000,0.693554,0.208066,http://oia.yonsei.ac.kr/partner/expReport.asp?...,Europe,Barcelona,41.502028,2.104687

In [30]:
df_temp.to_csv("./data_wrangled/df_univ_ranking.csv",encoding="utf-8", index=False)

In [21]:
df_temp["대륙"].unique()

array(['Europe', 'North America', 'Asia', 'Oceania'], dtype=object)

In [47]:
for index, row in df_temp.iterrows():
    university_title = row["대학명"]
    continent = row["대륙"]
    latitude = row["latitude"]
    longitude = row["longitude"]
    zoom_rate = 14
    country = row["국가"]
    rank = index
    visit_no = row["NUM_VISITS"]
    univ_code = row["대학코드"]
    # print(university_title, continent, university_title_without_space, latitude, longitude, country, rank, visit_no_int, univ_code)
    create_and_write_post(df_specific, university_title, continent, latitude, longitude, zoom_rate, country, rank, visit_no, univ_code)

## fix can not read a block mapping entry error
### https://github.com/fbrctr/fabricator/issues/241

In [9]:
df_univ_ranking[df_univ_ranking["대학명"].str.contains("'")]

,index,대학코드,국가,대학명,파견구분,협정형태,NUM_VISITS,BERT_SUM,RNN_SUM,BERT_AVG,RNN_AVG,BERT_PLUS_RNN_SCORE,COLLEGE_LINK,대륙,address,latitude,longitude
110,396,GB000026,UNITED KINGDOM,King's College London,교환학생SAP(정규)SAP(계절),교환대학,53.0,43.0,37.640448,0.811321,0.710197,0.780984,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=GB000026&bgbn=A,Europe,London WC2R 2LS,51.511486,-0.115997
231,47,CA000001,CANADA,Bishop's University,교환학생,교환대학,15.0,10.0,10.296898,0.666667,0.686460,0.672605,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=CA000001&bgbn=A,North America,QC J1M 1Z7,45.362853,-71.845657
237,141,FR000012,FRANCE,Universite d'Angers,교환학생,ISEP,6.0,4.0,3.953238,0.666667,0.658873,0.664329,http://oia.yonsei.ac.kr/partner/expReport.asp?ucode=FR000012&bgbn=A,Europe,49100 Angers,47.478472,-0.549656